       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRO2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REPLACE-TARGET.
           05 REPLACE-1 PIC X(5).
           05 REPLACE-2 PIC X(5).
           05 REPLACE-3 PIC X(10).
           05 REPLACE-4 PIC X(10).
           05 REPLACE-5 PIC N(10).
       01 STR PIC X(2) VALUE "ZX".
       PROCEDURE DIVISION.
       COMMENCE SECTION.
       REPLACE-STR.
      *CHARACTERS DESIGNATION
           MOVE "PC" TO REPLACE-1.
           INSPECT REPLACE-1 REPLACING CHARACTERS BY "Z".
      *ALL DESIGNATION
           MOVE "XYZXY" TO REPLACE-2.
           INSPECT REPLACE-2