       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRO66.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DATA_E.
           05 NUMBER1 PIC S9(5).
           05 NUMBER2 PIC S9(5) SIGN IS LEADING.
           05 NUMBER3 PIC S9(5) SIGN IS TRAILING.
           05 NUMBER4 PIC S9(5) SIGN IS LEADING SEPARATE.
       PROCEDURE DIVISION.
       START_E SECTION.
       INITIALIZE_E.
           INITIALIZE DATA_E.
       MOVE_E.
           MOVE -12345 TO NUMBER1 NUMBER2 NUMBER3 NUMBER4.
      *DATA CONTENT AFTER EXECUTE(x16)
      *NUMBER1->3132333475, NUMBER2->7132333435,
      *NUMBER3->3132333475, NUMBER4->203132333435
           DISPLAY "NUMBER1 : "NUMBER1.
           DISPLAY "NUMBER2 : "NUMBER2.
           DISPLAY "NUMBER3 : "NUMBER3.
           DISPLAY "NUMBER4 : "NUMBER4.
       END_EPROGRAM.
           STOP RUN.
